Autodesk.Revit.DB.Architecture.TopographyEditScope.Start(Autodesk.Revit.DB.ElementId)
Starts a topography surface edit mode for an existing TopographySurface element.
Remarks:
The application will need to start a transaction to actually make changes to the TopographySurface element.
TopographyEditScope can only be started when there is no transaction active, thus it does not
work for commands running in automatic transaction mode.
Like all Start methods in any edit scope object this too returns an Id of the element in the edit session,
even though in this case here it always equals to the given topoSurfaceId.
topoSurfaceId:
The TopographySurface element to be edited.
Returns:
The Id of the topography Surface being edited.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId topoSurfaceId does not represent a TopographySurface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This TopographyEditScope is not permitted to start at this moment for one of the following possible reasons:
The document is in read-only state, or the document is currently modifiable,
or there already is another edit mode active in the document.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographyEditScope.#ctor(Autodesk.Revit.DB.Document,System.String)
Instantiates a TopographyEditScope object.
document:
The document for which this TopographyEditScope is going to be used.
transactionName:
The name that will appear in the Undo menu in Revit after the TopographyEditScope is successfully committed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a primary document, it is a linked document.
-or-
document is not a project document.
-or-
transactionName is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014